Tinkerforge/esp32-firmware/software/src/modules/em_energy_analysis/em_energy_analysis.cpp
/* esp32-firmware
 * Copyright (C) 2023 Matthias Bolte <matthias@tinkerforge.com>
 *
 * This library is free software; you can redistribute it and/or
 * modify it under the terms of the GNU Lesser General Public
 * License as published by the Free Software Foundation; either
 * version 2 of the License, or (at your option) any later version.
 *
 * This library is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU
 * Lesser General Public License for more details.
 *
 * You should have received a copy of the GNU Lesser General Public
 * License along with this library; if not, write to the
 * Free Software Foundation, Inc., 59 Temple Place - Suite 330,
 * Boston, MA 02111-1307, USA.
 */

#define EVENT_LOG_PREFIX "em_energy_analys"

#include "em_energy_analysis.h"

#include <sys/time.h>

#include "modules/em_common/bricklet_bindings_constants.h"
#include "event_log_prefix.h"
#include "generated/module_dependencies.h"
#include "modules/charge_manager/charge_manager_private.h"
#include "tools/hexdump.h"

static constexpr micros_t MAX_DATA_AGE = 5_min;
#define MAX_PENDING_DATA_POINTS 250

#if MODULE_EM_V1_AVAILABLE()
#define FLAGS_NO_DATA 0x80
#elif MODULE_EM_V2_AVAILABLE()
#define FLAGS_NO_DATA 0x8000
#endif

//#define DEBUG_LOGGING

static const char *get_data_status_string(uint8_t status)
{
    switch (status) {
        case WEM_DATA_STATUS_OK:         return "OK";
        case WEM_DATA_SDATUS_SD_ERROR:   return "SD error";
        case WEM_DATA_SDATUS_LFS_ERROR:  return "LFS error";
        case WEM_DATA_SDATUS_QUEUE_FULL: return "queue full";
    }

    return "<unknown>";
}

void EMEnergyAnalysis::pre_setup()
{
    history_wallbox_5min = Config::Object({
        {"uid", Config::Uint32(0)},
        // date in UTC to avoid DST overlap problems
        {"year", Config::Uint(0, 2000, 2255)},
        {"month", Config::Uint(0, 1, 12)},
        {"day", Config::Uint(0, 1, 31)},
    });

    history_wallbox_daily = Config::Object({
        {"uid", Config::Uint32(0)},
        // date in local time to have the days properly aligned
        {"year", Config::Uint(0, 2000, 2255)},
        {"month", Config::Uint(0, 1, 12)},
    });

    history_energy_manager_5min = Config::Object({
        // date in UTC to avoid DST overlap problems
        {"year", Config::Uint(0, 2000, 2255)},
        {"month", Config::Uint(0, 1, 12)},
        {"day", Config::Uint(0, 1, 31)},
    });

    history_energy_manager_daily = Config::Object({
        // date in local time to have the days properly aligned
        {"year", Config::Uint(0, 2000, 2255)},
        {"month", Config::Uint(0, 1, 12)},
    });

    for (uint32_t slot = 0; slot < METERS_MAX_SLOTS_RECORDED; ++slot) {
        history_meter_setup_done[slot] = false;
        history_meter_power_value[slot] = NAN;
    }
}

void EMEnergyAnalysis::setup()
{
    if (!em_common.initialized) {
        return;
    }

    initialized = true;

    all_data_common = em_common.get_all_data_common();

    task_scheduler.scheduleWallClock([this]() {collect_data_points();}, 5_min, 100_ms, true);
    task_scheduler.scheduleUncancelable([this]() {set_pending_data_points();}, 15_s, 100_ms);
}

void EMEnergyAnalysis::register_urls()
{
    if (!em_common.initialized) {
        return;
    }

    api.addResponse("energy_manager/history_wallbox_5min",         &history_wallbox_5min,         {}, [this](Language /*language*/, IChunkedResponse *response, Ownership *ownership, uint32_t owner_id){history_wallbox_5min_response(response, ownership, owner_id);});
    api.addResponse("energy_manager/history_wallbox_daily",        &history_wallbox_daily,        {}, [this](Language /*language*/, IChunkedResponse *response, Ownership *ownership, uint32_t owner_id){history_wallbox_daily_response(response, ownership, owner_id);});
    api.addResponse("energy_manager/history_energy_manager_5min",  &history_energy_manager_5min,  {}, [this](Language /*language*/, IChunkedResponse *response, Ownership *ownership, uint32_t owner_id){history_energy_manager_5min_response(response, ownership, owner_id);});
    api.addResponse("energy_manager/history_energy_manager_daily", &history_energy_manager_daily, {}, [this](Language /*language*/, IChunkedResponse *response, Ownership *ownership, uint32_t owner_id){history_energy_manager_daily_response(response, ownership, owner_id);});
}

void EMEnergyAnalysis::register_events()
{
    for (uint32_t slot = 0; slot < METERS_MAX_SLOTS_RECORDED; ++slot) {
        if (meters.get_meter_class(slot) == MeterClassID::None) {
            continue;
        }

        // Passing no values will register on the ConfigRoot.
        event.registerEvent(meters.get_path(slot, Meters::PathType::ValueIDs), {}, [this, slot](const Config *config) {
            size_t count = config->count();

            if (count == 0) {
                if (show_blank_value_id_update_warnings) {
                    logger.printfln("Ignoring blank value IDs update from meter in slot %lu.", slot);
                }
                return EventResult::OK;
            }

            history_meter_setup_done[slot] = true;

            uint32_t power_index;
            if (meters.get_cached_power_index(slot, &power_index)) {
                event.registerEvent(meters.get_path(slot, Meters::PathType::Values), {static_cast<size_t>(power_index)}, [this, slot](const Config *config_power) {
                    update_history_meter_power(slot, config_power->asFloat());
                    return EventResult::OK;
                });
            } else {
                logger.printfln("Meter in slot %lu doesn't provide power.", slot);
            }

            return EventResult::Deregister;
        });
    }

    task_scheduler.scheduleOnce([this]() {
        this->show_blank_value_id_update_warnings = true;
    }, 250_ms);
}

void EMEnergyAnalysis::update_history_meter_power(uint32_t slot, float power /* W, must not be NaN */)
{
    micros_t now = now_us();

    if (!isnan(history_meter_power_value[slot])) {
        auto duration = now - history_meter_power_timestamp[slot];

        double power_last_interval_w = (double)history_meter_power_value[slot];
        double duration_s = duration.as<double>() / 1000000.0; // Don't use to<seconds_t>() before cast, divide afterwards to get fractional seconds.
        double energy_ws = power_last_interval_w * duration_s;

        history_meter_power_sum[slot] += energy_ws;
        history_meter_power_duration[slot] += duration_s;

        if (!persistent_data_loaded) {
            persistent_data_loaded = load_persistent_data();
        }

        if (persistent_data_loaded && energy_ws != 0) {
            double energy_dawh = energy_ws / 36000.0;

