Tinkerforge/esp32-firmware/software/src/modules/em_energy_analysis/em_energy_analysis.cpp
            if (energy_dawh >= 0) {
                history_meter_energy_import[slot] += energy_dawh;
            } else {
                history_meter_energy_export[slot] += -energy_dawh;
            }

            save_persistent_data();
        }
    }

    history_meter_power_value[slot] = power;
    history_meter_power_timestamp[slot] = now;
}

void EMEnergyAnalysis::collect_data_points()
{
    struct timeval tv;
    struct tm utc;
    struct tm local;

    if (!rtc.clock_synced(&tv)) {
        return;
    }

    if (!persistent_data_loaded) {
        persistent_data_loaded = load_persistent_data();

        if (!persistent_data_loaded) {
            return;
        }
    }

    gmtime_r(&tv.tv_sec, &utc);
    localtime_r(&tv.tv_sec, &local);

    // Even with scheduleWallClock still need to check if the slot has not already be written before the last boot
    uint32_t current_5min_slot = ((utc.tm_year * 366 + utc.tm_yday) * 24 + utc.tm_hour) * 12 + utc.tm_min / 5;

    if (current_5min_slot != last_history_5min_slot) {
        // 5min data
        for (size_t i = 0; i < charge_manager.get_charger_count(); ++i) {
            auto *charger = charge_manager.get_mutable_charger_state(i);
            micros_t last_update = charger->last_update;

            if (!deadline_elapsed(last_update + MAX_DATA_AGE)) {
                uint32_t uid = charger->uid;
#if MODULE_EM_V1_AVAILABLE()
                uint16_t flags = charger->charger_state; // v1: bit 0-2 = charger state, bit 7 = no data (read only)
#elif MODULE_EM_V2_AVAILABLE()
                uint16_t flags = charger->charger_state | (charger->phases << 3); // v2: bit 0-2 = charger state, bit 3-4 = phases, bit 15 = no data (read only)
#endif
                uint16_t power = UINT16_MAX;

                if (charger->meter_supported) {
                    float power_total_sum = charger->power_total_sum;
                    uint32_t power_total_count = charger->power_total_count;

                    charger->power_total_sum = 0;
                    charger->power_total_count = 0;

                    if (power_total_count > 0) {
                        power = clamp<uint64_t>(0,
                                                roundf(power_total_sum / power_total_count),
                                                UINT16_MAX - 1); // W
                    }
                }

                if (pending_data_points.size() > MAX_PENDING_DATA_POINTS) {
                    logger.printfln("Data point queue is full, dropping new data point");
                }
                else {
                    pending_data_points.push_back([this, utc, local, uid, flags, power]{
                        return set_wallbox_5min_data_point(&utc, &local, uid, flags, power);
                    });
                }
            }
#ifdef DEBUG_LOGGING
            else {
                logger.printfln("collect_data_points: skipping 5min u%lu, data too old %lu",
                                charger->uid, last_update.to<millis_t>().as<uint32_t>());
            }
#endif
        }

        if (all_data_common->is_valid && !deadline_elapsed(all_data_common->last_update + MAX_DATA_AGE)) {
            uint8_t flags = 0; // v1: bit 0 = 1p/3p, bit 1-2 = inputs, bit 3 = relay, bit 7 = no data (read only)
                               // v2: bit 0-3 = inputs, bit 4-5 = SG ready, bit 6-7 = relays, bit 15 = no data (read only)
            int32_t power[7] = {INT32_MAX, INT32_MAX, INT32_MAX, INT32_MAX, INT32_MAX, INT32_MAX, INT32_MAX}; // W
            int32_t price = INT32_MAX; // mct/kWh

            bool inputs[4];
            bool outputs[4];
            size_t input_len  = ARRAY_SIZE(inputs);
            size_t output_len = ARRAY_SIZE(outputs);

            em_common.get_input_output_states(inputs, &input_len, outputs, &output_len);
            // input_len and output_len now contain the actual value count

#if MODULE_EM_V1_AVAILABLE()
            flags |= power_manager.get_phases() > 1 ? 0b0001 : 0;
            flags |= inputs[0]                      ? 0b0010 : 0;
            flags |= inputs[1]                      ? 0b0100 : 0;
            flags |= outputs[0]                     ? 0b1000 : 0;
#elif MODULE_EM_V2_AVAILABLE()
            flags |= inputs[0]  ? (1 << 0) : 0;
            flags |= inputs[1]  ? (1 << 1) : 0;
            flags |= inputs[2]  ? (1 << 2) : 0;
            flags |= inputs[3]  ? (1 << 3) : 0;
            flags |= outputs[0] ? (1 << 4) : 0;
            flags |= outputs[1] ? (1 << 5) : 0;
            flags |= outputs[2] ? (1 << 6) : 0;
            flags |= outputs[3] ? (1 << 7) : 0;
#endif

            for (uint32_t slot = 0; slot < METERS_MAX_SLOTS_RECORDED; ++slot) {
                // FIXME: how to tell if meter data is stale?
                if (!isnan(history_meter_power_value[slot])) {
                    update_history_meter_power(slot, history_meter_power_value[slot]);

                    if (history_meter_power_duration[slot] > 0) {
                        power[slot] = clamp<int64_t>(INT32_MIN,
                                                     roundf(history_meter_power_sum[slot] / history_meter_power_duration[slot]),
                                                     INT32_MAX - 1); // W

                        history_meter_power_sum[slot] = 0;
                        history_meter_power_duration[slot] = 0;
                    }
                }
            }

#if MODULE_DAY_AHEAD_PRICES_AVAILABLE()
            {
                int32_t current_price_data;

                if (day_ahead_prices.get_current_price().try_unwrap(&current_price_data)) {
                    price = current_price_data + day_ahead_prices.get_grid_cost_plus_tax_plus_markup();
                }
            }
#endif

            if (pending_data_points.size() > MAX_PENDING_DATA_POINTS) {
                logger.printfln("Data point queue is full, dropping new data point");
            }
            else {
                pending_data_points.push_back([this, utc, local, flags, power, price] {
                    return set_energy_manager_5min_data_point(&utc, &local, flags, power, price);
                });
            }
        }

        // daily data
        for (size_t i = 0; i < charge_manager.get_charger_count(); ++i) {
            const auto *charger = charge_manager.get_charger_state(i);
            micros_t last_update = charger->last_update;

            if (!deadline_elapsed(last_update + MAX_DATA_AGE)) {
                bool have_data = false;
                uint32_t uid = charger->uid;
                uint32_t energy = UINT32_MAX;

                if (charger->meter_supported) {
                    have_data = true;
                    energy = clamp<uint64_t>(0,
                                             roundf(charger->energy_abs * 100.0),
                                             UINT32_MAX - 1); // kWh -> daWh
                }

