Tinkerforge/esp32-firmware/software/src/modules/em_energy_analysis/em_energy_analysis.cpp
                if (have_data) {
                    if (pending_data_points.size() > MAX_PENDING_DATA_POINTS) {
                        logger.printfln("Data point queue is full, dropping new data point");
                    }
                    else {
                        pending_data_points.push_back([this, local, uid, energy]{
                            return set_wallbox_daily_data_point(&local, uid, energy);
                        });
                    }
                }
#ifdef DEBUG_LOGGING
                else {
                    logger.printfln("collect_data_points: skipping daily u%lu, no data",
                                    charger->uid);
                }
#endif
            }
#ifdef DEBUG_LOGGING
            else {
                logger.printfln("collect_data_points: skipping daily u%lu, data too old %lu",
                                charger->uid, last_update.to<millis_t>().as<uint32_t>());
            }
#endif
        }

        bool have_data = false;
        uint32_t energy_import[7] = {UINT32_MAX, UINT32_MAX, UINT32_MAX, UINT32_MAX, UINT32_MAX, UINT32_MAX, UINT32_MAX}; // daWh
        uint32_t energy_export[7] = {UINT32_MAX, UINT32_MAX, UINT32_MAX, UINT32_MAX, UINT32_MAX, UINT32_MAX, UINT32_MAX}; // daWh
        int32_t price_min = INT32_MAX; // ct/kWh
        int32_t price_avg = INT32_MAX; // ct/kWh
        int32_t price_max = INT32_MAX; // ct/kWh

        MeterValueAvailability availability;

        for (uint32_t slot = 0; slot < METERS_MAX_SLOTS_RECORDED; ++slot) {
            if (meters.get_meter_class(slot) == MeterClassID::None) {
                continue; // don't record integrated energy values for unconfigured meters
            }

            float total_import; // kWh
            availability = meters.get_energy_import(slot, &total_import, MAX_DATA_AGE);
            if (availability == MeterValueAvailability::Fresh) {
                if (!isnan(total_import)) {
                    have_data = true;
                    energy_import[slot] = clamp<uint64_t>(0,
                                                          roundf(total_import * 100.0), // kWh -> daWh
                                                          UINT32_MAX - 1);
                }
            } else if (availability == MeterValueAvailability::Unavailable) {
                have_data = true;
                energy_import[slot] = clamp<uint64_t>(0, roundf(history_meter_energy_import[slot]), UINT32_MAX - 1);
            } else {
                // Value availability currently unknown or value is stale.
            }

            float total_export; // kWh
            availability = meters.get_energy_export(slot, &total_export, MAX_DATA_AGE);
            if (availability == MeterValueAvailability::Fresh) {
                if (!isnan(total_export)) {
                    have_data = true;
                    energy_export[slot] = clamp<uint64_t>(0,
                                                          roundf(total_export * 100.0), // kWh -> daWh
                                                          UINT32_MAX - 1);
                }
            } else if (availability == MeterValueAvailability::Unavailable) {
                have_data = true;
                energy_export[slot] = clamp<uint64_t>(0, roundf(history_meter_energy_export[slot]), UINT32_MAX - 1);
            } else {
                // Value availability currently unknown or value is stale.
            }
        }

#if MODULE_DAY_AHEAD_PRICES_AVAILABLE()
        {
            int32_t minimum_price_today_data;
            int32_t average_price_today_data;
            int32_t maximum_price_today_data;
            int32_t grid_cost_plus_tax_plus_markup = day_ahead_prices.get_grid_cost_plus_tax_plus_markup();

            if (day_ahead_prices.get_minimum_price_today().try_unwrap(&minimum_price_today_data)) {
                have_data = true;
                price_min = (minimum_price_today_data + grid_cost_plus_tax_plus_markup) / 1000; // mct/kWh -> ct/kWh (floor)
            }

            if (day_ahead_prices.get_average_price_today().try_unwrap(&average_price_today_data)) {
                have_data = true;
                price_avg = ((average_price_today_data + grid_cost_plus_tax_plus_markup) + 500) / 1000; // mct/kWh -> ct/kWh (round)
            }

            if (day_ahead_prices.get_maximum_price_today().try_unwrap(&maximum_price_today_data)) {
                have_data = true;
                price_max = ((maximum_price_today_data + grid_cost_plus_tax_plus_markup) + 999) / 1000; // mct/kWh -> ct/kWh (ceil)
            }
        }
#endif

        if (have_data) {
            if (pending_data_points.size() > MAX_PENDING_DATA_POINTS) {
                logger.printfln("Data point queue is full, dropping new data point");
            }
            else {
                pending_data_points.push_back([this, local, energy_import, energy_export, price_min, price_avg, price_max] {
                    return set_energy_manager_daily_data_point(&local, energy_import, energy_export, price_min, price_avg, price_max);
                });
            }
        }

        last_history_5min_slot = current_5min_slot;

        save_persistent_data();
    }
}

void EMEnergyAnalysis::set_pending_data_points()
{
    if (pending_data_points.empty()) {
        return;
    }

    if (!pending_data_points.front()()) {
        return;
    }

    pending_data_points.pop_front();
}

#define DATA_STORAGE_PAGE_SIZE 63
#define DATA_STORAGE_PAGE_COUNT 5

// this struct is 8 byte larger than initially expected, because the 8 byte
// alignment requirement for the double values was missed. but explicitly
// adding the extra padding now and making the struct packed results in
// "packed attribute causes inefficient alignment" warnings for every struct
// member after padding0. therefore, keeping the struct as is, because it
// has been like this in released versions and the memory layout of the
// struct cannot be changed anymore.
struct PersistentDataV1 {
    uint8_t version;
    uint8_t padding0[3];
    uint32_t last_history_5min_slot;
    uint32_t last_history_daily_slot; // unused
    // 4 byte of padding here for 8 byte alignment of the double values
    double history_meter_energy_import;
    double history_meter_energy_export;
    uint16_t padding1;
    uint16_t checksum;
    // 4 byte of padding here for 8 byte alignment of the double values
};

struct PersistentDataV2 {
    double history_meter_energy_import[6];
    double history_meter_energy_export[6];
    uint8_t version;
    uint8_t padding0;
    uint16_t checksum;
    uint32_t padding1;
};

struct PersistentDataV3 {
    double history_meter_energy_import[3];
    double history_meter_energy_export[3];
    uint8_t version;
    uint8_t padding0;
    uint16_t checksum;
    uint32_t padding1;
};

