Tinkerforge/esp32-firmware/software/src/modules/em_energy_analysis/em_energy_analysis.cpp
// Page 0: PersistentDataV1 + PersistentDataV2[0..22]
// Page 1: PersistentDataV2[23..85]
// Page 2: PersistentDataV2[86..103]
// Page 3: PersistentDataV3
// Page 4: PersistentDataV3

static_assert(sizeof(PersistentDataV1) == 40);
static_assert(sizeof(PersistentDataV2) == 104);
static_assert(sizeof(PersistentDataV3) == 56);

bool EMEnergyAnalysis::load_persistent_data()
{
    uint8_t buf[DATA_STORAGE_PAGE_SIZE * DATA_STORAGE_PAGE_COUNT] = {};
    bool all_not_found = true;

    for (uint8_t page = 0; page < DATA_STORAGE_PAGE_COUNT; ++page) {
        uint8_t status = WEM_DATA_STORAGE_STATUS_BUSY;

        if (em_common.wem_get_data_storage(page, &status, buf + (DATA_STORAGE_PAGE_SIZE * page)) != TF_E_OK) {
            return false;
        }

        switch (status) {
        case WEM_DATA_STORAGE_STATUS_BUSY:
            logger.printfln("Persistent data page %u not available yet, trying again later", page);
            return false;

        case WEM_DATA_STORAGE_STATUS_NOT_FOUND:
            break;

        case WEM_DATA_STORAGE_STATUS_OK:
            all_not_found = false;
            break;

        default:
            logger.printfln("Persistent data page %u has unknown status, trying again later: %d", page, status);
            return false;
        }
    }

    if (all_not_found) {
        logger.printfln("All persistent data pages not found, first boot?");
        return true;
    }

    load_persistent_data_v1(buf);

    if (!load_persistent_data_v2(buf + sizeof(PersistentDataV1))) {
        load_persistent_data_v3(buf + (DATA_STORAGE_PAGE_SIZE * 3), 1);
        load_persistent_data_v3(buf + (DATA_STORAGE_PAGE_SIZE * 4), 4);
    }

#ifdef DEBUG_LOGGING
    logger.printfln("load_persistent_data: 5min slot %lu, energy %f/%f %f/%f %f/%f %f/%f %f/%f %f/%f %f/%f",
                    last_history_5min_slot,
                    history_meter_energy_import[0],
                    history_meter_energy_export[0],
                    history_meter_energy_import[1],
                    history_meter_energy_export[1],
                    history_meter_energy_import[2],
                    history_meter_energy_export[2],
                    history_meter_energy_import[3],
                    history_meter_energy_export[3],
                    history_meter_energy_import[4],
                    history_meter_energy_export[4],
                    history_meter_energy_import[5],
                    history_meter_energy_export[5],
                    history_meter_energy_import[6],
                    history_meter_energy_export[6]);
#endif

    return true;
}

void EMEnergyAnalysis::load_persistent_data_v1(uint8_t *buf)
{
    logger.printfln("Loading persistent data v1");

    PersistentDataV1 data_v1;
    memcpy(&data_v1, buf, sizeof(data_v1));

    PersistentDataV1 zero_v1;
    memset(&zero_v1, 0, sizeof(zero_v1));

    char data_v1_hexdump[sizeof(data_v1) * 2 + 1];

    if (memcmp(&data_v1, &zero_v1, sizeof(data_v1)) == 0) {
        logger.printfln("Persistent data v1 all zero, first boot?");
        return;
    }

    if (internet_checksum(&data_v1, sizeof(data_v1)) != 0) {
        logger.printfln("Checksum mismatch for persistent data v1");
        hexdump((uint8_t *)&data_v1, sizeof(data_v1), data_v1_hexdump, ARRAY_SIZE(data_v1_hexdump), HexdumpCase::Lower);
        logger.printfln_plain("Persistent data v1: %s", data_v1_hexdump);
        return;
    }

    if (data_v1.version != 1) {
        logger.printfln("Unexpected version %u for persistent data v1", data_v1.version);
        hexdump((uint8_t *)&data_v1, sizeof(data_v1), data_v1_hexdump, ARRAY_SIZE(data_v1_hexdump), HexdumpCase::Lower);
        logger.printfln_plain("Persistent data v1: %s", data_v1_hexdump);
        return;
    }

    last_history_5min_slot = data_v1.last_history_5min_slot;
    history_meter_energy_import[0] = data_v1.history_meter_energy_import;
    history_meter_energy_export[0] = data_v1.history_meter_energy_export;
}

// Don't inline this helper so that the hexdump array is only on the stack when in use.
[[gnu::noinline]]
static void hexdump_persistent_data_v2(const PersistentDataV2 &data_v2)
{
    char data_v2_hexdump[sizeof(data_v2) * 2 + 1];
    hexdump((uint8_t *)&data_v2, sizeof(data_v2), data_v2_hexdump, ARRAY_SIZE(data_v2_hexdump), HexdumpCase::Lower);
    logger.printfln_plain("Persistent data v2: %s", data_v2_hexdump);
}

bool EMEnergyAnalysis::load_persistent_data_v2(uint8_t *buf)
{
    logger.printfln("Loading persistent data v2");

    PersistentDataV2 data_v2;
    memcpy(&data_v2, buf, sizeof(data_v2));

    PersistentDataV2 zero_v2;
    memset(&zero_v2, 0, sizeof(zero_v2));

    if (memcmp(&data_v2, &zero_v2, sizeof(data_v2)) == 0) {
        logger.printfln("Persistent data v2 all zero, first boot?");
        return false; // try loading persistent data v3
    }

    if (internet_checksum(&data_v2, sizeof(data_v2)) != 0) {
        logger.printfln("Checksum mismatch for persistent data v2");
        // This checksum mismatch is rather common, so don't dump data here.
        return false; // try loading persistent data v3
    }

    if (data_v2.version != 2) {
        logger.printfln("Unexpected version %u for persistent data v2", data_v2.version);
        hexdump_persistent_data_v2(data_v2);
        return false; // try loading persistent data v3
    }

    for (uint32_t slot = 1; slot < METERS_MAX_SLOTS_RECORDED; ++slot) {
        history_meter_energy_import[slot] = data_v2.history_meter_energy_import[slot - 1];
        history_meter_energy_export[slot] = data_v2.history_meter_energy_export[slot - 1];
    }

    return true; // skip loading persistent data v3
}

// Don't inline this helper so that the hexdump array is only on the stack when in use.
[[gnu::noinline]]
static void hexdump_persistent_data_v3(const PersistentDataV3 &data_v3, uint32_t start_slot)
{
    char data_v3_hexdump[sizeof(data_v3) * 2 + 1];
    hexdump((uint8_t *)&data_v3, sizeof(data_v3), data_v3_hexdump, ARRAY_SIZE(data_v3_hexdump), HexdumpCase::Lower);
    logger.printfln_plain("Persistent data v3 start slot %lu: %s", start_slot, data_v3_hexdump);
}

void EMEnergyAnalysis::load_persistent_data_v3(uint8_t *buf, uint32_t start_slot)
{
    logger.printfln("Loading persistent data v3 for start slot %lu", start_slot);

    PersistentDataV3 data_v3;
    memcpy(&data_v3, buf, sizeof(data_v3));

