Tinkerforge/esp32-firmware/software/src/modules/em_energy_analysis/em_energy_analysis.cpp
    PersistentDataV3 zero_v3;
    memset(&zero_v3, 0, sizeof(zero_v3));

    if (memcmp(&data_v3, &zero_v3, sizeof(data_v3)) == 0) {
        logger.printfln("Persistent data v3 for start slot %lu all zero, first boot?", start_slot);
        return;
    }

    if (internet_checksum(&data_v3, sizeof(data_v3)) != 0) {
        logger.printfln("Checksum mismatch for persistent data v3 for start slot %lu", start_slot);
        hexdump_persistent_data_v3(data_v3, start_slot);
        return;
    }

    if (data_v3.version != 3) {
        logger.printfln("Unexpected version %u for persistent data v3 for start slot %lu", data_v3.version, start_slot);
        hexdump_persistent_data_v3(data_v3, start_slot);
        return;
    }

    for (uint32_t slot = start_slot; slot < start_slot + 3 && slot < METERS_MAX_SLOTS_RECORDED; ++slot) {
        history_meter_energy_import[slot] = data_v3.history_meter_energy_import[slot - start_slot];
        history_meter_energy_export[slot] = data_v3.history_meter_energy_export[slot - start_slot];
    }
}

void EMEnergyAnalysis::save_persistent_data()
{
    PersistentDataV1 data_v1;
    memset(&data_v1, 0, sizeof(data_v1));

    PersistentDataV2 data_v2;
    memset(&data_v2, 0, sizeof(data_v2));

    PersistentDataV3 data_v3a;
    memset(&data_v3a, 0, sizeof(data_v3a));

    PersistentDataV3 data_v3b;
    memset(&data_v3b, 0, sizeof(data_v3b));

#ifdef DEBUG_LOGGING
    logger.printfln("save_persistent_data: 5min slot %lu, energy %f/%f %f/%f %f/%f %f/%f %f/%f %f/%f %f/%f",
                    last_history_5min_slot,
                    history_meter_energy_import[0],
                    history_meter_energy_export[0],
                    history_meter_energy_import[1],
                    history_meter_energy_export[1],
                    history_meter_energy_import[2],
                    history_meter_energy_export[2],
                    history_meter_energy_import[3],
                    history_meter_energy_export[3],
                    history_meter_energy_import[4],
                    history_meter_energy_export[4],
                    history_meter_energy_import[5],
                    history_meter_energy_export[5],
                    history_meter_energy_import[6],
                    history_meter_energy_export[6]);
#endif

    data_v1.version = 1;
    data_v1.last_history_5min_slot = last_history_5min_slot;
    data_v1.last_history_daily_slot = 0; // unused
    data_v1.history_meter_energy_import = history_meter_energy_import[0];
    data_v1.history_meter_energy_export = history_meter_energy_export[0];
    data_v1.checksum = internet_checksum(&data_v1, sizeof(data_v1));

    for (uint32_t slot = 1; slot < METERS_MAX_SLOTS_RECORDED; ++slot) {
        data_v2.history_meter_energy_import[slot - 1] = history_meter_energy_import[slot];
        data_v2.history_meter_energy_export[slot - 1] = history_meter_energy_export[slot];
    }

    data_v2.version = 2;
    data_v2.checksum = internet_checksum(&data_v2, sizeof(data_v2));

    for (uint32_t slot = 1; slot < 4 && slot < METERS_MAX_SLOTS_RECORDED; ++slot) {
        data_v3a.history_meter_energy_import[slot - 1] = history_meter_energy_import[slot];
        data_v3a.history_meter_energy_export[slot - 1] = history_meter_energy_export[slot];
    }

    data_v3a.version = 3;
    data_v3a.checksum = internet_checksum(&data_v3a, sizeof(data_v3a));

    for (uint32_t slot = 4; slot < METERS_MAX_SLOTS_RECORDED; ++slot) {
        data_v3b.history_meter_energy_import[slot - 4] = history_meter_energy_import[slot];
        data_v3b.history_meter_energy_export[slot - 4] = history_meter_energy_export[slot];
    }

    data_v3b.version = 3;
    data_v3b.checksum = internet_checksum(&data_v3b, sizeof(data_v3b));

    uint8_t buf[DATA_STORAGE_PAGE_SIZE * DATA_STORAGE_PAGE_COUNT] = {};
    memcpy(buf, &data_v1, sizeof(data_v1));
    memcpy(buf + sizeof(data_v1), &data_v2, sizeof(data_v2));
    memcpy(buf + (DATA_STORAGE_PAGE_SIZE * 3), &data_v3a, sizeof(data_v3a));
    memcpy(buf + (DATA_STORAGE_PAGE_SIZE * 4), &data_v3b, sizeof(data_v3b));

    for (uint8_t page = 0; page < DATA_STORAGE_PAGE_COUNT; ++page) {
        em_common.wem_set_data_storage(page, buf + (DATA_STORAGE_PAGE_SIZE * page));
    }
}

bool EMEnergyAnalysis::set_wallbox_5min_data_point(const struct tm *utc, const struct tm *local, uint32_t uid, uint16_t flags, uint16_t power /* W */)
{
    uint8_t status;
    uint8_t utc_year = utc->tm_year - 100;
    uint8_t utc_month = utc->tm_mon + 1;
    uint8_t utc_day = utc->tm_mday;
    uint8_t utc_hour = utc->tm_hour;
    uint8_t utc_minute = (utc->tm_min / 5) * 5;
    int rc = em_common.wem_set_sd_wallbox_data_point(uid,
                                                     utc_year,
                                                     utc_month,
                                                     utc_day,
                                                     utc_hour,
                                                     utc_minute,
                                                     flags,
                                                     power,
                                                     &status);

#ifdef DEBUG_LOGGING
    logger.printfln("set_wallbox_5min_data_point: u%lu %d-%02d-%02d %02d:%02d f%u p%u",
                    uid, 2000 + utc_year, utc_month, utc_day, utc_hour, utc_minute, flags, power);
#endif

    if (rc != TF_E_OK) {
        if (rc == TF_E_TIMEOUT || em_common.device_module_is_in_bootloader(rc)) {
            return false; // retry
        }
        else {
            logger.printfln("Failed to set wallbox 5min data point: error %d", rc);
            return true;
        }
    }
    else if (status != 0) {
        if (status == WEM_DATA_SDATUS_QUEUE_FULL) {
            return false; // retry
        }
        else {
            logger.printfln("Failed to set wallbox 5min data point: status (%s, %u)", get_data_status_string(status), status);
            return true;
        }
    }
    else {
        char power_str[6] = "null";

        if (power != UINT16_MAX) {
            snprintf(power_str, sizeof(power_str), "%u", power);
        }

