Tinkerforge/esp32-firmware/software/src/modules/em_energy_analysis/em_energy_analysis.cpp
        uint8_t local_year = local->tm_year - 100;
        uint8_t local_month = local->tm_mon + 1;
        uint8_t local_day = local->tm_mday;
        uint8_t local_hour = local->tm_hour;
        uint8_t local_minute = (local->tm_min / 5) * 5;
        char *buf;
        int buf_written = asprintf(&buf,
                                   "{\"topic\":\"energy_manager/history_wallbox_5min_changed\","
                                    "\"payload\":{"
                                    "\"uid\":%lu,"
                                    "\"year\":%u,"
                                    "\"month\":%u,"
                                    "\"day\":%u,"
                                    "\"hour\":%u,"
                                    "\"minute\":%u,"
                                    "\"flags\":%u,"
                                    "\"power\":%s}}\n",
                                   uid,
                                   2000U + local_year,
                                   local_month,
                                   local_day,
                                   local_hour,
                                   local_minute,
                                   flags,
                                   power_str);

        if (buf_written > 0) {
            ws.web_sockets.sendToAllOwned(buf, buf_written);
        }

        return true;
    }
}

bool EMEnergyAnalysis::set_wallbox_daily_data_point(const struct tm *local, uint32_t uid, uint32_t energy /* daWh */)
{
    uint8_t status;
    uint8_t year = local->tm_year - 100;
    uint8_t month = local->tm_mon + 1;
    uint8_t day = local->tm_mday;
    int rc = em_common.wem_set_sd_wallbox_daily_data_point(uid, year, month, day, energy, &status);

#ifdef DEBUG_LOGGING
    logger.printfln("set_wallbox_daily_data_point: u%lu %d-%02d-%02d e%lu",
                    uid, 2000 + year, month, day, energy);
#endif

    if (rc != TF_E_OK) {
        if (rc == TF_E_TIMEOUT || em_common.device_module_is_in_bootloader(rc)) {
            return false; // retry
        }
        else {
            logger.printfln("Failed to set wallbox daily data point: error %d", rc);
            return true;
        }
    }
    else if (status != 0) {
        if (status == WEM_DATA_SDATUS_QUEUE_FULL) {
            return false; // retry
        }
        else {
            logger.printfln("Failed to set wallbox daily data point: status (%s, %u)", get_data_status_string(status), status);
            return true;
        }
    }
    else {
        char energy_str[12] = "null";

        if (energy != UINT32_MAX) {
            snprintf(energy_str, sizeof(energy_str), "%.2f", (double)energy / 100.0); // daWh -> kWh
        }

        char *buf;
        int buf_written = asprintf(&buf,
                                   "{\"topic\":\"energy_manager/history_wallbox_daily_changed\","
                                    "\"payload\":{"
                                    "\"uid\":%lu,"
                                    "\"year\":%u,"
                                    "\"month\":%u,"
                                    "\"day\":%u,"
                                    "\"energy\":%s}}\n",
                                   uid,
                                   2000U + year,
                                   month,
                                   day,
                                   energy_str);

        if (buf_written > 0) {
            ws.web_sockets.sendToAllOwned(buf, buf_written);
        }

        return true;
    }
}

bool EMEnergyAnalysis::set_energy_manager_5min_data_point(const struct tm *utc,
                                                          const struct tm *local,
                                                          const uint16_t flags,
                                                          const int32_t power[7] /* W */,
                                                          const int32_t price /* mct/kWh */)
{
    uint32_t price_bits = UINT32_MAX;

    if (price != INT32_MAX) {
        price_bits = (uint32_t)price;
    }

    uint8_t status;
    uint8_t utc_year = utc->tm_year - 100;
    uint8_t utc_month = utc->tm_mon + 1;
    uint8_t utc_day = utc->tm_mday;
    uint8_t utc_hour = utc->tm_hour;
    uint8_t utc_minute = (utc->tm_min / 5) * 5;
    int rc = em_common.wem_set_sd_energy_manager_data_point(utc_year,
                                                            utc_month,
                                                            utc_day,
                                                            utc_hour,
                                                            utc_minute,
                                                            flags,
                                                            power[0],
                                                            &power[1],
                                                            price_bits,
                                                            &status);

#ifdef DEBUG_LOGGING
    logger.printfln("set_energy_manager_5min_data_point: %d-%02d-%02d %02d:%02d f%u po%ld,%ld,%ld,%ld,%ld,%ld,%ld pr%ld",
                    2000 + utc_year, utc_month, utc_day, utc_hour, utc_minute, flags, power[0], power[1], power[2], power[3], power[4], power[5], power[6], price);
#endif

    if (rc != TF_E_OK) {
        if (rc == TF_E_TIMEOUT || em_common.device_module_is_in_bootloader(rc)) {
            return false; // retry
        }
        else {
            logger.printfln("Failed to set energy manager 5min data point: error %d", rc);
            return true;
        }
    }
    else if (status != 0) {
        if (status == WEM_DATA_SDATUS_QUEUE_FULL) {
            return false; // retry
        }
        else {
            logger.printfln("Failed to set energy manager 5min data point: status (%s, %u)", get_data_status_string(status), status);
            return true;
        }
    }
    else {
        char power_str[7][12] = {"null", "null", "null", "null", "null", "null", "null"};
        char price_str[12] = "null";

