Tinkerforge/esp32-firmware/software/src/modules/em_energy_analysis/em_energy_analysis.cpp
        for (int i = 0; i < 7; ++i) {
            if (power[i] != INT32_MAX) {
                snprintf(power_str[i], sizeof(power_str[i]), "%li", power[i]);
            }
        }

        if (price != INT32_MAX) {
            snprintf(price_str, sizeof(price_str), "%.3f", (double)price / 1000.0); // mct/kWh -> ct/kWh
        }

        uint8_t local_year = local->tm_year - 100;
        uint8_t local_month = local->tm_mon + 1;
        uint8_t local_day = local->tm_mday;
        uint8_t local_hour = local->tm_hour;
        uint8_t local_minute = (local->tm_min / 5) * 5;
        char *buf;
        int buf_written = asprintf(&buf,
                                   "{\"topic\":\"energy_manager/history_energy_manager_5min_changed\","
                                    "\"payload\":{"
                                    "\"year\":%u,"
                                    "\"month\":%u,"
                                    "\"day\":%u,"
                                    "\"hour\":%u,"
                                    "\"minute\":%u,"
                                    "\"flags\":%u,"
                                    "\"power\":[%s,%s,%s,%s,%s,%s,%s],"
                                    "\"price\":%s}}\n",
                                   2000U + local_year,
                                   local_month,
                                   local_day,
                                   local_hour,
                                   local_minute,
                                   flags,
                                   power_str[0],
                                   power_str[1],
                                   power_str[2],
                                   power_str[3],
                                   power_str[4],
                                   power_str[5],
                                   power_str[6],
                                   price_str);

        if (buf_written > 0) {
            ws.web_sockets.sendToAllOwned(buf, buf_written);
        }

        return true;
    }
}

#define PRICE_UINT10_MAX 1023
#define PRICE_INT10_MAX  911
#define PRICE_INT10_MIN  (PRICE_INT10_MAX - PRICE_UINT10_MAX)

static uint32_t price_to_10bit(int32_t price)
{
    if (price == INT32_MAX) {
        return PRICE_UINT10_MAX;
    }

    return static_cast<uint32_t>(clamp(static_cast<int32_t>(PRICE_INT10_MIN), price, static_cast<int32_t>(PRICE_INT10_MAX)) - static_cast<int32_t>(PRICE_INT10_MIN));
}

static int32_t price_from_10bit(uint32_t price)
{
    if (price >= PRICE_UINT10_MAX) {
        return INT32_MAX;
    }

    return price + PRICE_INT10_MIN;
}

bool EMEnergyAnalysis::set_energy_manager_daily_data_point(const struct tm *local,
                                                           const uint32_t energy_import[7] /* daWh */,
                                                           const uint32_t energy_export[7] /* daWh */,
                                                           int32_t price_min /* ct/kWh */,
                                                           int32_t price_avg /* ct/kWh */,
                                                           int32_t price_max /* ct/kWh */)
{
    uint8_t status;
    uint8_t year = local->tm_year - 100;
    uint8_t month = local->tm_mon + 1;
    uint8_t day = local->tm_mday;
    uint32_t price_bits = (price_to_10bit(price_min) << 20) | (price_to_10bit(price_avg) << 10) | price_to_10bit(price_max);
    int rc = em_common.wem_set_sd_energy_manager_daily_data_point(year,
                                                                  month,
                                                                  day,
                                                                  energy_import[0],
                                                                  energy_export[0],
                                                                  &energy_import[1],
                                                                  &energy_export[1],
                                                                  price_bits,
                                                                  &status);

#ifdef DEBUG_LOGGING
    logger.printfln("set_energy_manager_daily_data_point: %d-%02d-%02d ei%lu,%lu,%lu,%lu,%lu,%lu,%lu ee%lu,%lu,%lu,%lu,%lu,%lu,%lu p%ld,%ld,%ld",
                    2000 + year, month, day,
                    energy_import[0], energy_import[1], energy_import[2], energy_import[3], energy_import[4], energy_import[5], energy_import[6],
                    energy_export[0], energy_export[1], energy_export[2], energy_export[3], energy_export[4], energy_export[5], energy_export[6],
                    price_min, price_avg, price_max);
#endif

    if (rc != TF_E_OK) {
        if (rc == TF_E_TIMEOUT || em_common.device_module_is_in_bootloader(rc)) {
            return false; // retry
        }
        else {
            logger.printfln("Failed to set energy manager daily data point: error %i", rc);
            return true;
        }
    }
    else if (status != 0) {
        if (status == WEM_DATA_SDATUS_QUEUE_FULL) {
            return false; // retry
        }
        else {
            logger.printfln("Failed to set energy manager daily data point: status (%s, %u)", get_data_status_string(status), status);
            return true;
        }
    }
    else {
        char energy_import_str[7][13] = {"null", "null", "null", "null", "null", "null", "null"};
        char energy_export_str[7][13] = {"null", "null", "null", "null", "null", "null", "null"};
        char price_min_str[12] = "null";
        char price_avg_str[12] = "null";
        char price_max_str[12] = "null";

        for (int i = 0; i < 7; ++i) {
            if (energy_import[i] != UINT32_MAX) {
                snprintf(energy_import_str[i], sizeof(energy_import_str[i]), "%.2f", (double)energy_import[i] / 100.0); // daWh -> kWh
            }

            if (energy_export[i] != UINT32_MAX) {
                snprintf(energy_export_str[i], sizeof(energy_export_str[i]), "%.2f", (double)energy_export[i] / 100.0); // daWh -> kWh
            }
        }

