Tinkerforge/esp32-firmware/software/src/modules/em_energy_analysis/em_energy_analysis.cpp
        if (price_min != INT32_MAX) {
            snprintf(price_min_str, sizeof(price_min_str), "%li", price_min);
        }

        if (price_avg != INT32_MAX) {
            snprintf(price_avg_str, sizeof(price_avg_str), "%li", price_avg);
        }

        if (price_max != INT32_MAX) {
            snprintf(price_max_str, sizeof(price_max_str), "%li", price_max);
        }

        char *buf;
        int buf_written = asprintf(&buf,
                                   "{\"topic\":\"energy_manager/history_energy_manager_daily_changed\","
                                    "\"payload\":{"
                                    "\"year\":%u,"
                                    "\"month\":%u,"
                                    "\"day\":%u,"
                                    "\"energy_import\":[%s,%s,%s,%s,%s,%s,%s],"
                                    "\"energy_export\":[%s,%s,%s,%s,%s,%s,%s],"
                                    "\"price_min\":%s,"
                                    "\"price_avg\":%s,"
                                    "\"price_max\":%s}}\n",
                                   2000U + year,
                                   month,
                                   day,
                                   energy_import_str[0],
                                   energy_import_str[1],
                                   energy_import_str[2],
                                   energy_import_str[3],
                                   energy_import_str[4],
                                   energy_import_str[5],
                                   energy_import_str[6],
                                   energy_export_str[0],
                                   energy_export_str[1],
                                   energy_export_str[2],
                                   energy_export_str[3],
                                   energy_export_str[4],
                                   energy_export_str[5],
                                   energy_export_str[6],
                                   price_min_str,
                                   price_avg_str,
                                   price_max_str);

        if (buf_written > 0) {
            ws.web_sockets.sendToAllOwned(buf, buf_written);
        }

        return true;
    }
}

typedef struct {
    IChunkedResponse *response;
    Ownership *response_ownership;
    uint32_t response_owner_id;
    bool call_begin;
    bool write_comma;
    uint16_t next_offset;
    uint32_t seqnum;
    uint32_t uid;
    uint8_t utc_end_year;
    uint8_t utc_end_month;
    uint8_t utc_end_day;
    uint16_t utc_end_slots;
} StreamMetadata;

static StreamMetadata metadata_array[4];

struct [[gnu::packed]] Wallbox5minData {
#if MODULE_EM_V1_AVAILABLE()
    uint8_t flags;  // v1: bit 0-2 = charger state, bit 7 = no data (read only)
#elif MODULE_EM_V2_AVAILABLE()
    uint16_t flags; // v2: bit 0-2 = charger state, bit 3-4 = phases, bit 15 = no data (read only)
#endif
    uint16_t power; // W
};

static void wallbox_5min_data_points_handler(void *do_not_use, uint16_t data_length, uint16_t data_chunk_offset, uint8_t data_chunk_data[60], void *user_data)
{
    StreamMetadata *metadata = (StreamMetadata *)user_data;
    IChunkedResponse *response = metadata->response;
    ChunkedResponseResult write_result;
    OwnershipGuard ownership_guard(metadata->response_ownership, metadata->response_owner_id);

    if (!ownership_guard.have_ownership()) {
        em_common.wem_register_sd_wallbox_data_points_low_level_callback(nullptr, nullptr);
        return;
    }

    if (metadata->call_begin) {
        metadata->call_begin = false;

        response->begin(true);

        if (write_result) {
            write_result = response->write("[");
        }
    }

    if (metadata->next_offset != data_chunk_offset) {
        logger.printfln("Failed to get wallbox 5min data point: seqnum %lu, stream out of sync (%hu != %hu)", metadata->seqnum, metadata->next_offset, data_chunk_offset);

        if (write_result) {
            write_result = response->write("]");
        }

        write_result &= response->flush();
        response->end(write_result);

        em_common.wem_register_sd_wallbox_data_points_low_level_callback(nullptr, nullptr);
        return;
    }

    uint16_t actual_length = data_length - data_chunk_offset;
    uint16_t i;
    Wallbox5minData *p;

    if (actual_length > 60) {
        actual_length = 60;
    }

    if (metadata->write_comma && write_result) {
        write_result = response->write(",");
    }

    for (i = 0; i < actual_length && write_result; i += sizeof(Wallbox5minData)) {
        p = (Wallbox5minData *)&data_chunk_data[i];

        if ((p->flags & FLAGS_NO_DATA) == 0) {
            write_result = response->writef("%u", p->flags);
        } else {
            p->power = UINT16_MAX;
            write_result = response->writef("null");
        }

        if (write_result) {
            if (p->power != UINT16_MAX) {
                write_result = response->writef(",%u", p->power);
            } else {
                write_result = response->writef(",null");
            }

            if (write_result && i < actual_length - sizeof(Wallbox5minData)) {
                write_result = response->write(",");
            }
        }
    }

    metadata->write_comma = true;
    metadata->next_offset += 60;

    if (metadata->next_offset >= data_length) {
        if (metadata->utc_end_slots > 0) {
            if (!write_result) {
                response->flush();
                response->end(write_result);

                em_common.wem_register_sd_wallbox_data_points_low_level_callback(nullptr, nullptr);
            } else {
                task_scheduler.scheduleOnce([metadata, response]{
                    uint8_t status;
                    int rc = em_common.wem_get_sd_wallbox_data_points(metadata->uid,
                                                                      metadata->utc_end_year,
                                                                      metadata->utc_end_month,
                                                                      metadata->utc_end_day,
                                                                      0,
                                                                      0,
                                                                      metadata->utc_end_slots,
                                                                      &status);

                    metadata->next_offset = 0;
                    metadata->utc_end_slots = 0;

                    if (rc != TF_E_OK || status != 0) {
                        if (rc != TF_E_OK) {
                            logger.printfln("Failed to continue getting wallbox 5min data point: seqnum %lu, error %d", metadata->seqnum, rc);
                        }
                        else if (status != 0) {
                            logger.printfln("Failed to continue getting wallbox 5min data point: seqnum %lu, status (%s, %hhu)", metadata->seqnum, get_data_status_string(status), status);
                        }

