Tinkerforge/esp32-firmware/software/src/modules/em_energy_analysis/em_energy_analysis.cpp
                        OwnershipGuard ownership_guard2(metadata->response_ownership, metadata->response_owner_id);

                        if (ownership_guard2.have_ownership()) {
                            response->flush();
                            response->end(ChunkedResponseResult{ESP_FAIL, "Failed to continue getting wallbox 5min data point"});
                        }

                        em_common.wem_register_sd_wallbox_data_points_low_level_callback(nullptr, nullptr);
                    }
                });
            }
        }
        else {
            if (write_result) {
                write_result = response->write("]");
            }

            write_result &= response->flush();
            response->end(write_result);

            em_common.wem_register_sd_wallbox_data_points_low_level_callback(nullptr, nullptr);
        }

        return;
    }

    if (!write_result) {
        response->end(write_result);

        em_common.wem_register_sd_wallbox_data_points_low_level_callback(nullptr, nullptr);
        return;
    }
}

void EMEnergyAnalysis::history_wallbox_5min_response(IChunkedResponse *response, Ownership *response_ownership, uint32_t response_owner_id)
{
    uint32_t uid = history_wallbox_5min.get("uid")->asUint();

    // history is stored with date in UTC to avoid DST overlap problems.
    // API accepts date in localtime, convert from localtime to UTC
    uint8_t local_year = history_wallbox_5min.get("year")->asUint() - 2000;
    uint8_t local_month = history_wallbox_5min.get("month")->asUint();
    uint8_t local_day = history_wallbox_5min.get("day")->asUint();

    struct tm local_start;
    struct tm local_end;

    memset(&local_start, 0, sizeof(local_start));
    memset(&local_end, 0, sizeof(local_end));

    local_start.tm_year = local_year + 100;
    local_start.tm_mon = local_month - 1;
    local_start.tm_mday = local_day;
    local_start.tm_isdst = -1;

    local_end.tm_year = local_year + 100;
    local_end.tm_mon = local_month - 1;
    local_end.tm_mday = local_day + 1;
    local_end.tm_isdst = -1;

    time_t time_start = mktime(&local_start);
    time_t time_end = mktime(&local_end);
    struct tm utc_start;
    struct tm utc_end;

    gmtime_r(&time_start, &utc_start);
    gmtime_r(&time_end, &utc_end);

    uint8_t utc_start_year = utc_start.tm_year - 100;
    uint8_t utc_start_month = utc_start.tm_mon + 1;
    uint8_t utc_start_day = utc_start.tm_mday;
    uint8_t utc_start_hour = utc_start.tm_hour;
    uint8_t utc_start_minute = utc_start.tm_min;
    uint16_t utc_start_slots = ((23 - utc_start_hour) * 60 + (60 - utc_start_minute)) / 5; // till midnight

    uint8_t utc_end_year = utc_end.tm_year - 100;
    uint8_t utc_end_month = utc_end.tm_mon + 1;
    uint8_t utc_end_day = utc_end.tm_mday;
    uint8_t utc_end_hour = utc_end.tm_hour;
    uint8_t utc_end_minute = utc_end.tm_min;
    uint16_t utc_end_slots = (utc_end_hour * 60 + utc_end_minute) / 5; // since midnight

    uint32_t seqnum = history_request_seqnum++;
    StreamMetadata *metadata = &metadata_array[0];

    metadata->response = response;
    metadata->response_ownership = response_ownership;
    metadata->response_owner_id = response_owner_id;
    metadata->call_begin = true;
    metadata->write_comma = false;
    metadata->next_offset = 0;
    metadata->seqnum = seqnum;
    metadata->uid = uid;
    metadata->utc_end_year = utc_end_year;
    metadata->utc_end_month = utc_end_month;
    metadata->utc_end_day = utc_end_day;
    metadata->utc_end_slots = utc_start_slots > 0 ? utc_end_slots : 0;

    em_common.wem_register_sd_wallbox_data_points_low_level_callback(wallbox_5min_data_points_handler, metadata);

    uint8_t status;
    int rc;

    if (utc_start_slots > 0) {
        rc = em_common.wem_get_sd_wallbox_data_points(uid,
                                                      utc_start_year,
                                                      utc_start_month,
                                                      utc_start_day,
                                                      utc_start_hour,
                                                      utc_start_minute,
                                                      utc_start_slots,
                                                      &status);
    } else {
        rc = em_common.wem_get_sd_wallbox_data_points(uid,
                                                      utc_end_year,
                                                      utc_end_month,
                                                      utc_end_day,
                                                      utc_end_hour,
                                                      utc_end_minute,
                                                      utc_end_slots,
                                                      &status);
    }

    //logger.printfln("history_wallbox_5min_response: u%u %d-%02d-%02d",
    //                uid, 2000 + year, month, day);

    if (rc != TF_E_OK || status != 0) {
        em_common.wem_register_sd_wallbox_data_points_low_level_callback(nullptr, nullptr);

        OwnershipGuard ownership_guard(response_ownership, response_owner_id);

        if (ownership_guard.have_ownership()) {
            ChunkedResponseResult write_result;

            response->begin(false);

            if (rc != TF_E_OK) {
                write_result = response->writef("Failed to get wallbox 5min data point: seqnum %lu, error %i", seqnum, rc);
                logger.printfln("Failed to get wallbox 5min data point: seqnum %lu, error %i", seqnum, rc);
            }
            else if (status != 0) {
                write_result = response->writef("Failed to get wallbox 5min data point: seqnum %lu, status (%s, %hhu)", seqnum, get_data_status_string(status), status);
                logger.printfln("Failed to get wallbox 5min data point: seqnum %lu, status (%s, %hhu)", seqnum, get_data_status_string(status), status);
            }

            write_result &= response->flush();
            response->end(write_result);
        }
    }
}

static void wallbox_daily_data_points_handler(void *do_not_use,
                                              uint16_t data_length,
                                              uint16_t data_chunk_offset,
                                              uint32_t data_chunk_data[15],
                                              void *user_data)
{
    StreamMetadata *metadata = (StreamMetadata *)user_data;
    IChunkedResponse *response = metadata->response;
    ChunkedResponseResult write_result;
    OwnershipGuard ownership_guard(metadata->response_ownership, metadata->response_owner_id);

    if (!ownership_guard.have_ownership()) {
        em_common.wem_register_sd_wallbox_daily_data_points_low_level_callback(nullptr, nullptr);
        return;
    }

    if (metadata->call_begin) {
        metadata->call_begin = false;

        response->begin(true);

        if (write_result) {
            write_result = response->write("[");
        }
    }

    if (metadata->next_offset != data_chunk_offset) {
        logger.printfln("Failed to get wallbox daily data point: seqnum %lu, stream out of sync (%hu != %hu)",
                        metadata->seqnum, metadata->next_offset, data_chunk_offset);

        if (write_result) {
            write_result = response->write("]");
        }

        write_result &= response->flush();
        response->end(write_result);

        em_common.wem_register_sd_wallbox_daily_data_points_low_level_callback(nullptr, nullptr);
        return;
    }

