Tinkerforge/esp32-firmware/software/src/modules/em_energy_analysis/em_energy_analysis.cpp
    uint16_t actual_length = data_length - data_chunk_offset;
    uint16_t i;

    if (actual_length > 15) {
        actual_length = 15;
    }

    if (metadata->write_comma && write_result) {
        write_result = response->write(",");
    }

    for (i = 0; i < actual_length && write_result; ++i) {
        if (data_chunk_data[i] != UINT32_MAX) {
            write_result = response->writef("%.2f", (double)data_chunk_data[i] / 100.0); // daWh -> kWh
        } else {
            write_result = response->write("null");
        }

        if (write_result && i < actual_length - 1) {
            write_result = response->write(",");
        }
    }

    metadata->write_comma = true;
    metadata->next_offset += 15;

    if (metadata->next_offset >= data_length) {
        if (write_result) {
            write_result = response->write("]");
        }

        write_result &= response->flush();
        response->end(write_result);

        em_common.wem_register_sd_wallbox_daily_data_points_low_level_callback(nullptr, nullptr);
        return;
    }

    if (!write_result) {
        response->end(write_result);

        em_common.wem_register_sd_wallbox_daily_data_points_low_level_callback(nullptr, nullptr);
        return;
    }
}

static int days_per_month(int year, int month)
{
    if (month == 2) {
        if ((year % 400) == 0 || ((year % 100) != 0 && (year % 4) == 0)) {
            return 29;
        }

        return 28;
    }

    if (month == 4 || month == 6 || month == 9 || month == 11) {
        return 30;
    }

    return 31;
}

void EMEnergyAnalysis::history_wallbox_daily_response(IChunkedResponse *response,
                                                      Ownership *response_ownership,
                                                      uint32_t response_owner_id)
{
    uint32_t uid = history_wallbox_daily.get("uid")->asUint();

    // date in local time to have the days properly aligned
    uint8_t year = history_wallbox_daily.get("year")->asUint() - 2000;
    uint8_t month = history_wallbox_daily.get("month")->asUint();

    uint32_t seqnum = history_request_seqnum++;
    StreamMetadata *metadata = &metadata_array[1];

    metadata->response = response;
    metadata->response_ownership = response_ownership;
    metadata->response_owner_id = response_owner_id;
    metadata->call_begin = true;
    metadata->write_comma = false;
    metadata->next_offset = 0;
    metadata->seqnum = seqnum;

    em_common.wem_register_sd_wallbox_daily_data_points_low_level_callback(wallbox_daily_data_points_handler, metadata);

    uint8_t status;
    int rc = em_common.wem_get_sd_wallbox_daily_data_points(uid, year, month, 1, days_per_month(2000 + year, month), &status);

    //logger.printfln("history_wallbox_daily_response: u%u %d-%02d",
    //                uid, 2000 + year, month);

    if (rc != TF_E_OK || status != 0) {
        em_common.wem_register_sd_wallbox_daily_data_points_low_level_callback(nullptr, nullptr);

        OwnershipGuard ownership_guard(response_ownership, response_owner_id);

        if (ownership_guard.have_ownership()) {
            ChunkedResponseResult write_result;

            response->begin(false);

            if (rc != TF_E_OK) {
                write_result = response->writef("Failed to get wallbox daily data point: seqnum %lu, error %i", seqnum, rc);
                logger.printfln("Failed to get wallbox daily data point: seqnum %lu, error %i", seqnum, rc);
            }
            else if (status != 0) {
                write_result = response->writef("Failed to get wallbox daily data point: seqnum %lu, status (%s, %hhu)", seqnum, get_data_status_string(status), status);
                logger.printfln("Failed to get wallbox daily data point: seqnum %lu, status (%s, %hhu)", seqnum, get_data_status_string(status), status);
            }

            write_result &= response->flush();
            response->end(write_result);
        }
    }
}

struct [[gnu::packed]] EnergyManager5MinData {
#if MODULE_EM_V1_AVAILABLE()
    uint8_t flags;  // v1: bit 0 = 1p/3p, bit 1-2 = inputs, bit 3 = relay, bit 7 = no data (read only)
#elif MODULE_EM_V2_AVAILABLE()
    uint16_t flags; // v2: bit 0-3 = inputs, bit 4-5 = SG ready, bit 6-7 = relays, bit 15 = no data (read only)
#endif
    int32_t power[7]; // W
    uint32_t price_bits; // mct/kWh
};

static void energy_manager_5min_data_points_handler(void *do_not_use,
                                                    uint16_t data_length,
                                                    uint16_t data_chunk_offset,
                                                    uint8_t data_chunk_data[34], // v1: 33 byte, v2: 34 byte
                                                    void *user_data)
{
    StreamMetadata *metadata = (StreamMetadata *)user_data;
    IChunkedResponse *response = metadata->response;
    ChunkedResponseResult write_result;
    OwnershipGuard ownership_guard(metadata->response_ownership, metadata->response_owner_id);

    if (!ownership_guard.have_ownership()) {
        em_common.wem_register_sd_energy_manager_data_points_low_level_callback(nullptr, nullptr);
        return;
    }

    if (metadata->call_begin) {
        metadata->call_begin = false;

        response->begin(true);

        if (write_result) {
            write_result = response->write("[");
        }
    }

    if (metadata->next_offset != data_chunk_offset) {
        logger.printfln("Failed to get energy manager 5min data point: seqnum %lu, stream out of sync (%hu != %hu)",
                        metadata->seqnum, metadata->next_offset, data_chunk_offset);

        if (write_result) {
            write_result = response->write("]");
        }

        write_result &= response->flush();
        response->end(write_result);

        em_common.wem_register_sd_energy_manager_data_points_low_level_callback(nullptr, nullptr);
        return;
    }

    uint16_t actual_length = data_length - data_chunk_offset;

    if (actual_length >= sizeof(EnergyManager5MinData)) {
        if (metadata->write_comma && write_result) {
            write_result = response->write(",", 1);
        }

