Tinkerforge/esp32-firmware/software/src/modules/em_energy_analysis/em_energy_analysis.cpp
        EnergyManager5MinData *p = (EnergyManager5MinData *)data_chunk_data;

        if (write_result) {
            if ((p->flags & FLAGS_NO_DATA) == 0) {
                write_result = response->writef("%u", p->flags);
            } else {
                write_result = response->writef("null");

                for (int k = 0; k < 7; ++k) {
                    p->power[k] = INT32_MAX;
                }

                p->price_bits = UINT32_MAX;
            }
        }

        if (write_result) {
            for (int k = 0; k < 7 && write_result; ++k) {
                if (p->power[k] != INT32_MAX) {
                    write_result = response->writef(",%ld", p->power[k]);
                } else {
                    write_result = response->writef(",null");
                }
            }
        }

        if (write_result) {
            if (p->price_bits != UINT32_MAX) {
                write_result = response->writef(",%.3f", (double)(int32_t)p->price_bits / 1000.0); // mct/kWh -> ct/kWh
            } else {
                write_result = response->writef(",null");
            }
        }
    }

    metadata->write_comma = true;
#if MODULE_EM_V1_AVAILABLE()
    metadata->next_offset += 33;
#elif MODULE_EM_V2_AVAILABLE()
    metadata->next_offset += 34;
#endif

    if (metadata->next_offset >= data_length) {
        if (metadata->utc_end_slots > 0) {
            if (!write_result) {
                response->flush();
                response->end(write_result);

                em_common.wem_register_sd_energy_manager_data_points_low_level_callback(nullptr, nullptr);
            } else {
                task_scheduler.scheduleOnce([metadata, response]{
                    uint8_t status;
                    int rc = em_common.wem_get_sd_energy_manager_data_points(metadata->utc_end_year,
                                                                             metadata->utc_end_month,
                                                                             metadata->utc_end_day,
                                                                             0,
                                                                             0,
                                                                             metadata->utc_end_slots,
                                                                             &status);

                    metadata->next_offset = 0;
                    metadata->utc_end_slots = 0;

                    if (rc != TF_E_OK || status != 0) {
                        if (rc != TF_E_OK) {
                            logger.printfln("Failed to continue getting energy manager 5min data point: seqnum %lu, error %i", metadata->seqnum, rc);
                        }
                        else if (status != 0) {
                            logger.printfln("Failed to continue getting energy manager 5min data point: seqnum %lu, status (%s, %hhu)", metadata->seqnum, get_data_status_string(status), status);
                        }

                        OwnershipGuard ownership_guard2(metadata->response_ownership, metadata->response_owner_id);

                        if (ownership_guard2.have_ownership()) {
                            response->flush();
                            response->end(ChunkedResponseResult{ESP_FAIL, "Failed to continue getting energy manager 5min data point"});
                        }

                        em_common.wem_register_sd_energy_manager_data_points_low_level_callback(nullptr, nullptr);
                    }
                });
            }
        }
        else {
            if (write_result) {
                write_result = response->write("]");
            }

            write_result &= response->flush();
            response->end(write_result);

            em_common.wem_register_sd_energy_manager_data_points_low_level_callback(nullptr, nullptr);
        }

        return;
    }

    if (!write_result) {
        response->end(write_result);

        em_common.wem_register_sd_energy_manager_data_points_low_level_callback(nullptr, nullptr);
        return;
    }
}

void EMEnergyAnalysis::history_energy_manager_5min_response(IChunkedResponse *response,
                                                            Ownership *response_ownership,
                                                            uint32_t response_owner_id)
{
    // history is stored with date in UTC to avoid DST overlap problems.
    // API accepts date in localtime, convert from localtime to UTC
    uint8_t local_year = history_energy_manager_5min.get("year")->asUint() - 2000;
    uint8_t local_month = history_energy_manager_5min.get("month")->asUint();
    uint8_t local_day = history_energy_manager_5min.get("day")->asUint();

    struct tm local_start;
    struct tm local_end;

    memset(&local_start, 0, sizeof(local_start));
    memset(&local_end, 0, sizeof(local_end));

    local_start.tm_year = local_year + 100;
    local_start.tm_mon = local_month - 1;
    local_start.tm_mday = local_day;
    local_start.tm_isdst = -1;

    local_end.tm_year = local_year + 100;
    local_end.tm_mon = local_month - 1;
    local_end.tm_mday = local_day + 1;
    local_end.tm_isdst = -1;

    time_t time_start = mktime(&local_start);
    time_t time_end = mktime(&local_end);
    struct tm utc_start;
    struct tm utc_end;

    gmtime_r(&time_start, &utc_start);
    gmtime_r(&time_end, &utc_end);

    uint8_t utc_start_year = utc_start.tm_year - 100;
    uint8_t utc_start_month = utc_start.tm_mon + 1;
    uint8_t utc_start_day = utc_start.tm_mday;
    uint8_t utc_start_hour = utc_start.tm_hour;
    uint8_t utc_start_minute = utc_start.tm_min;
    uint16_t utc_start_slots = ((23 - utc_start_hour) * 60 + (60 - utc_start_minute)) / 5; // till midnight

    uint8_t utc_end_year = utc_end.tm_year - 100;
    uint8_t utc_end_month = utc_end.tm_mon + 1;
    uint8_t utc_end_day = utc_end.tm_mday;
    uint8_t utc_end_hour = utc_end.tm_hour;
    uint8_t utc_end_minute = utc_end.tm_min;
    uint16_t utc_end_slots = (utc_end_hour * 60 + utc_end_minute) / 5; // since midnight

    uint32_t seqnum = history_request_seqnum++;
    StreamMetadata *metadata = &metadata_array[2];

    metadata->response = response;
    metadata->response_ownership = response_ownership;
    metadata->response_owner_id = response_owner_id;
    metadata->call_begin = true;
    metadata->write_comma = false;
    metadata->next_offset = 0;
    metadata->seqnum = seqnum;
    metadata->utc_end_year = utc_end_year;
    metadata->utc_end_month = utc_end_month;
    metadata->utc_end_day = utc_end_day;
    metadata->utc_end_slots = utc_start_slots > 0 ? utc_end_slots : 0;

    em_common.wem_register_sd_energy_manager_data_points_low_level_callback(energy_manager_5min_data_points_handler, metadata);

    uint8_t status;
    int rc;

    if (utc_start_slots > 0) {
        rc = em_common.wem_get_sd_energy_manager_data_points(utc_start_year,
                                                             utc_start_month,
                                                             utc_start_day,
                                                             utc_start_hour,
                                                             utc_start_minute,
                                                             utc_start_slots,
                                                             &status);
    }
    else {
        rc = em_common.wem_get_sd_energy_manager_data_points(utc_end_year,
                                                             utc_end_month,
                                                             utc_end_day,
                                                             utc_end_hour,
                                                             utc_end_minute,
                                                             utc_end_slots,
                                                             &status);
    }

    //logger.printfln("history_energy_manager_5min_response: %d-%02d-%02d",
    //                2000 + year, month, day);

    if (rc != TF_E_OK || status != 0) {
        em_common.wem_register_sd_energy_manager_data_points_low_level_callback(nullptr, nullptr);

