Tinkerforge/esp32-firmware/software/src/modules/em_energy_analysis/em_energy_analysis.cpp
        OwnershipGuard ownership_guard(response_ownership, response_owner_id);

        if (ownership_guard.have_ownership()) {
            ChunkedResponseResult write_result;

            response->begin(false);

            if (rc != TF_E_OK) {
                write_result = response->writef("Failed to get energy manager 5min data point: seqnum %lu, error %i", seqnum, rc);
                logger.printfln("Failed to get energy manager 5min data point: seqnum %lu, error %i", seqnum, rc);
            }
            else if (status != 0) {
                write_result = response->writef("Failed to get energy manager 5min data point: seqnum %lu, status (%s, %hhu)", seqnum, get_data_status_string(status), status);
                logger.printfln("Failed to get energy manager 5min data point: seqnum %lu, status (%s, %hhu)", seqnum, get_data_status_string(status), status);
            }

            write_result &= response->flush();
            response->end(write_result);
        }
    }
}

static void energy_manager_daily_data_points_handler(void *do_not_use,
                                                     uint16_t data_length,
                                                     uint16_t data_chunk_offset,
                                                     uint32_t data_chunk_data[15],
                                                     void *user_data)
{
    StreamMetadata *metadata = (StreamMetadata *)user_data;
    IChunkedResponse *response = metadata->response;
    ChunkedResponseResult write_result;
    OwnershipGuard ownership_guard(metadata->response_ownership, metadata->response_owner_id);

    if (!ownership_guard.have_ownership()) {
        em_common.wem_register_sd_energy_manager_daily_data_points_low_level_callback(nullptr, nullptr);
        return;
    }

    if (metadata->call_begin) {
        metadata->call_begin = false;

        response->begin(true);

        if (write_result) {
            write_result = response->write("[");
        }
    }

    if (metadata->next_offset != data_chunk_offset) {
        logger.printfln("Failed to get energy manager daily data point: seqnum %lu, stream out of sync (%hu != %hu)",
                        metadata->seqnum, metadata->next_offset, data_chunk_offset);

        if (write_result) {
            write_result = response->write("]");
        }

        write_result &= response->flush();
        response->end(write_result);

        em_common.wem_register_sd_energy_manager_daily_data_points_low_level_callback(nullptr, nullptr);
        return;
    }

    uint16_t actual_length = data_length - data_chunk_offset;
    uint16_t i;

    if (actual_length > 15) {
        actual_length = 15;
    }

    if (metadata->write_comma && write_result) {
        write_result = response->write(",");
    }

    // the data is stored as:
    // i0, e0, i1, i2, i3, i4, i5, i6, e1, e2, e3, e4, e5, e6, p
    // but we want to report it as:
    // i0, i1, i2, i3, i4, i5, i6, e0, e1, e2, e3, e4, e5, e6, p
    uint32_t energy_export_0 = data_chunk_data[1];
    memmove(&data_chunk_data[1], &data_chunk_data[2], sizeof(uint32_t) * 6);
    data_chunk_data[7] = energy_export_0;

    for (i = 0; i < actual_length && write_result; ++i) {
        if (i == 14) {
            if (data_chunk_data[i] != UINT32_MAX) {
                int32_t price_min = price_from_10bit((data_chunk_data[i] >> 20) & 0x3FF);
                int32_t price_avg = price_from_10bit((data_chunk_data[i] >> 10) & 0x3FF);
                int32_t price_max = price_from_10bit( data_chunk_data[i]        & 0x3FF);

                if (price_min != INT32_MAX) {
                    write_result = response->writef("%ld", price_min);
                }
                else {
                    write_result = response->writef("null");
                }

                if (write_result) {
                    if (price_avg != INT32_MAX) {
                        write_result = response->writef(",%ld", price_avg);
                    }
                    else {
                        write_result = response->writef(",null");
                    }
                }

                if (write_result) {
                    if (price_max != INT32_MAX) {
                        write_result = response->writef(",%ld", price_max);
                    }
                    else {
                        write_result = response->writef(",null");
                    }
                }
            } else {
                write_result = response->write("null,null,null");
            }
        }
        else {
            if (data_chunk_data[i] != UINT32_MAX) {
                write_result = response->writef("%.2f", (double)data_chunk_data[i] / 100.0); // daWh -> kWh
            } else {
                write_result = response->write("null");
            }
        }

        if (write_result && i < actual_length - 1) {
            write_result = response->write(",");
        }
    }

    metadata->write_comma = true;
    metadata->next_offset += 15;

    if (metadata->next_offset >= data_length) {
        if (write_result) {
            write_result = response->write("]");
        }

        write_result &= response->flush();
        response->end(write_result);

        em_common.wem_register_sd_energy_manager_daily_data_points_low_level_callback(nullptr, nullptr);
        return;
    }

    if (!write_result) {
        response->end(write_result);

        em_common.wem_register_sd_energy_manager_daily_data_points_low_level_callback(nullptr, nullptr);
        return;
    }
}

void EMEnergyAnalysis::history_energy_manager_daily_response(IChunkedResponse *response,
                                                             Ownership *response_ownership,
                                                             uint32_t response_owner_id)
{
    // date in local time to have the days properly aligned
    uint8_t year = history_energy_manager_daily.get("year")->asUint() - 2000;
    uint8_t month = history_energy_manager_daily.get("month")->asUint();

    uint32_t seqnum = history_request_seqnum++;
    StreamMetadata *metadata = &metadata_array[3];

    metadata->response = response;
    metadata->response_ownership = response_ownership;
    metadata->response_owner_id = response_owner_id;
    metadata->call_begin = true;
    metadata->write_comma = false;
    metadata->next_offset = 0;
    metadata->seqnum = seqnum;

    em_common.wem_register_sd_energy_manager_daily_data_points_low_level_callback(energy_manager_daily_data_points_handler, metadata);

    uint8_t status;
    int rc = em_common.wem_get_sd_energy_manager_daily_data_points(year, month, 1, days_per_month(2000 + year, month), &status);

    //logger.printfln("history_energy_manager_daily_response: %d-%02d",
    //                2000 + year, month);

    if (rc != TF_E_OK || status != 0) {
        em_common.wem_register_sd_energy_manager_daily_data_points_low_level_callback(nullptr, nullptr);

        OwnershipGuard ownership_guard(response_ownership, response_owner_id);

        if (ownership_guard.have_ownership()) {
            ChunkedResponseResult write_result;

            response->begin(false);

            if (rc != TF_E_OK) {
                write_result = response->writef("Failed to get energy manager daily data point: seqnum %lu, error %i", seqnum, rc);
                logger.printfln("Failed to get energy manager daily data point: seqnum %lu, error %i", seqnum, rc);
            }
            else if (status != 0) {
                write_result = response->writef("Failed to get energy manager daily data point: seqnum %lu, status (%s, %hhu)", seqnum, get_data_status_string(status), status);
                logger.printfln("Failed to get energy manager daily data point: seqnum %lu, status (%s, %hhu)", seqnum, get_data_status_string(status), status);
            }

            write_result &= response->flush();
            response->end(write_result);
        }
    }
}
